In [24]:
import numpy as np
import pandas as pd

In [3]:
file=pd.read_excel('fileadded.xlsx')

In [4]:
file.shape

(9137, 11)

In [5]:
cols=[]
for i in range(len(file.columns)):
    cols.append(file.columns[i].lower())
#cols
# trun column headers into lower case text

In [6]:
file.columns=cols

In [7]:
file.shape

(9137, 11)

In [32]:
file.head()

,customer,st,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,customer lifetime valuecustomer lifetime value...,0,1000,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,customer lifetime valuecustomer lifetime value...,0,94,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,customer lifetime valuecustomer lifetime value...,48767,108,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,customer lifetime valuecustomer lifetime value...,0,106,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,customer lifetime valuecustomer lifetime value...,36357,68,Personal Auto,Four-Door Car,17.269323

Concatenate the three dataframes - I have added the three excel files before importing I believe that had the same effect

In [9]:
file.dtypes

customer                     object
st                           object
gender                       object
education                    object
customer lifetime value      object
income                        int64
monthly premium auto          int64
number of open complaints    object
policy type                  object
vehicle class                object
total claim amount           object
dtype: object

Which columns are numerical? - income, monthly premium auto

Which columns are categorical? - all the rest of the columns

customer                     object
st                           object
gender                       object
education                    object
customer lifetime value      object
number of open complaints    object
policy type                  object
vehicle class                object
total claim amount           object

Understand the meaning of all columns

Customer code, state, gender, education and so an as we can see in the excel doocument

In [10]:
file=file.drop(['education','number of open complaints'],axis=1)

In [33]:
file.head()

,customer,st,gender,customer lifetime value,income,monthly premium auto,policy type,vehicle class,total claim amount
0,RB50392,Washington,NaN,customer lifetime valuecustomer lifetime value...,0,1000,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,customer lifetime valuecustomer lifetime value...,0,94,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,customer lifetime valuecustomer lifetime value...,48767,108,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,customer lifetime valuecustomer lifetime value...,0,106,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,customer lifetime valuecustomer lifetime value...,36357,68,Personal Auto,Four-Door Car,17.269323

In [12]:
file['customer lifetime value']=pd.to_numeric(file['customer lifetime value'],errors='coerce')

In [43]:
#multiply 'customer lifetime value' by 100

#I have made a mistake with multiplying customer customer lifetime value and I can't seem to correct it

file.head()

,Customer,State,Customer Lifetime Value,Gender,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Total Claim Amount,Vehicle Class
0,AA11235,Nevada,2.568843e+05,F,11167,73,3,Personal Auto,350.4,Two-Door Car
1,AA16582,Washington,2.412750e+06,M,14072,71,0,Personal Auto,511.2,Four-Door Car
2,AA34092,California,2.879995e+06,M,33635,240,0,Personal Auto,1152.0,Luxury SUV
3,AA56476,Arizona,5.595390e+05,F,74454,71,0,Corporate Auto,340.8,Four-Door Car
4,AA69265,Nevada,3.964731e+05,F,60817,103,1,Personal Auto,494.4,Four-Door Car

In [21]:
file = file.drop_duplicates()
print(file.head())

  customer          st gender  customer lifetime value  income  \
0  RB50392  Washington    NaN                      NaN       0
1  QZ44356     Arizona      F                      NaN       0
2  AI49188      Nevada      F                      NaN   48767
3  WW63253  California      M                      NaN       0
4  GA49547  Washington      M                      NaN   36357

   monthly premium auto     policy type  vehicle class total claim amount
0                  1000   Personal Auto  Four-Door Car           2.704934
1                    94   Personal Auto  Four-Door Car        1131.464935
2                   108   Personal Auto   Two-Door Car         566.472247
3                   106  Corporate Auto            SUV         529.881344
4                    68   Personal Auto  Four-Door Car          17.269323

In [17]:
#if I filter out the zero income manually from excel is that acceptable?

In [22]:
file.shape

(9137, 9)

In [40]:
file.to_excel('1234.xlsx',index=False)

In [41]:
file=pd.read_excel('file3333.xlsx')

In [42]:
file.shape

(5249, 10)